# 문제 1
virtual_signal_dict = [{'시간':'09:02:22', '종목명':'삼성전자', '현재가':79000, '매매시그널':'매수'},
                      {'시간':'11:11:55', '종목명':'푸드나무', '현재가':35000, '매매시그널':'매도'},
                      {'시간':'11:31:12', '종목명':'아이에이', '현재가':1600, '매매시그널':'매수'},
                      {'시간':'13:44:01', '종목명':'하이닉스', '현재가':102000, '매매시그널':'매수'},
                      {'시간':'15:09:26', '종목명':'심성전자', '현재가':79000, '매매시그널':'매수'},
                      {'시간':'15:26:15', '종목명':'HMM', '현재가':37000, '매매시그널':'매도'}]

for i in virtual_signal_dict:
    print(f"매매 시그널 포착 : {i['시간']} {i['종목명']} {i['현재가']} {i['매매시그널']}")

    inp = input(f"매매 시그널 포착 : {i['시간']} {i['종목명']} {i['현재가']} {i['매매시그널']} 매매하시겠습니까? : ")

    if inp == "매수":
        print("매수되었습니다")
    elif inp == "매도":
        print("매도되었습니다")


print(f"매매 시그널 포착 : {virtual_signal_dict[0]['시간']} {virtual_signal_dict[0]['종목명']} {virtual_signal_dict[0]['현재가']} {virtual_signal_dict[0]['매매시그널']}")